elua/elua/src/platform/lm3s/usblib/usbmode.c
//*****************************************************************************
//
//! Handles OTG mode changes and also steers other USB interrupts from
//! the controller to the correct handler in the USB stack.
//!
//! This interrupt handler is used in applications which require to operate
//! in both host and device mode using OTG.  When in host or device mode, it
//! steers the USB hardware interrupt to the correct handler in the USB stack
//! depending upon the current operating mode.  It also handles other OTG
//! related interrupt events.
//!
//! For successful OTG mode operation, an application must register
//! USB0OTGModeIntHandler() in the CPU vector table as the interrupt handler
//! for the USB0 interrupt.
//!
//! \note This interrupt handler should only be used on controllers that support
//! OTG functionality.
//!
//! \return None.
//
//*****************************************************************************
void
USB0OTGModeIntHandler(void)
{
    unsigned long ulStatus;

    //
    // Read the USB interrupt status.
    //
    ulStatus = USBIntStatusControl(USB0_BASE);

    //
    // Check if this was an mode detect interrupt and under manual power
    // control.
    //
    if((ulStatus & USB_INTCTRL_MODE_DETECT) &&
       (USBHCDPowerAutomatic(0) == 0))
    {
        unsigned long ulMode;

        ulMode = USBModeGet(USB0_BASE);

        switch(ulMode)
        {
            //
            // Device is on the A side of the cable and power needs to be
            // applied.
            //
            case USB_OTG_MODE_ASIDE_NPWR:
            case USB_OTG_MODE_ASIDE_SESS:
            case USB_OTG_MODE_ASIDE_AVAL:
            {
                //
                // Since power is not automatically enabled, call the
                // registered event handler to allow the application to turn
                // on power.
                //
                InternalUSBHCDSendEvent(USB_EVENT_POWER_ENABLE);

                break;
            }

            //
            // Device is on the B side of the cable and powered.
            //
            case USB_OTG_MODE_BSIDE_DEV:
            {
                //
                // Now in device mode on the B side of the cable and will wait
                // for a connect before becoming a device.
                //
                g_eOTGModeState = USB_OTG_MODE_B_WAITCON;

                break;
            }

            //
            // Any other mode detect indicates USB_MODE_NONE.
            //
            default:
            {
                //
                // Just inform the application that the mode was not device
                // or host.
                //
                USBOTGSetMode(USB_MODE_NONE);

                break;
            }
        }
    }

    //
    // If there was a VBUS error then the power should be shut off and the system
    // is reset to waiting for detection again.
    //
    if(ulStatus & USB_INTCTRL_VBUS_ERR)
    {
        //
        // Just inform the application that the mode was not device
        // or host.
        //
        USBOTGSetMode(USB_MODE_NONE);

        //
        // Return to idle mode.
        //
        g_eOTGModeState = USB_OTG_MODE_WAIT;
    }

    //
    // If there is a disconnect interrupt and the controller was on the B side
    // cable as a device then go back to the IDLE state.
    //
    if((ulStatus & USB_INTCTRL_DISCONNECT) &&
       (g_eOTGModeState == USB_OTG_MODE_B_DEVICE))
    {
        //
        // No longer a device so switch to unconfigured mode.
        //
        USBOTGSetMode(USB_MODE_NONE);

        //
        // Return to idle mode.
        //
        g_eOTGModeState = USB_OTG_MODE_WAIT;

        return;
    }

    //
    // Handle receiving a reset.
    //
    if((ulStatus & USB_INTCTRL_RESET)&&
       (g_eOTGModeState != USB_OTG_MODE_B_DEVICE))
    {
        //
        // Getting a reset interrupt when not already a b side device indicates
        // that a host is resetting the device and the controller should
        // move to device mode.
        //
        g_eOTGModeState = USB_OTG_MODE_B_DEVICE;

        //
        // Save the new mode.
        //
        USBOTGSetMode(USB_MODE_DEVICE);
    }

    //
    // If there is a connect interrupt while the library is waiting for
    // one then move to full host mode state.
    //
    if(ulStatus & USB_INTCTRL_CONNECT)
    {
        //
        // Move to A side host state.
        //
        g_eOTGModeState = USB_OTG_MODE_A_HOST;

        //
        // Inform the application that controller is in host mode.
        //
        USBOTGSetMode(USB_MODE_HOST);
    }

    //
    // Call the correct device or host interrupt handler based on the current
    // mode of operation.
    //
    switch(g_eOTGModeState)
    {
        case USB_OTG_MODE_A_HOST:
        {
            //
            // Call the host interrupt handler if there is anything still to
            // process.
            //
            USBHostIntHandlerInternal(0, ulStatus);

            break;
        }

        //
        // Operating in pure device mode.
        //
        case USB_OTG_MODE_B_DEVICE:
        {
            //
            // Call the device interrupt handler.
            //
            USBDeviceIntHandlerInternal(0, ulStatus);

            break;
        }
        default:
        {
            break;
        }
    }
}

//*****************************************************************************
//
// This function is called by the USB host stack code to indicated that it
// has compeleted handing the device disconnection.
//
// \param ulIndex specifies the USB controller that has completed disconnect.
//
// This internal library function is used when the hsot controller has completed
// any deferred handling when it has detected a device has been disconnected.
// The functions main purpose is to return the OTG controller to a state that
// allows for resuming normal OTG cable detection and negotiation.
//
// \note This function should not be called outside the library.
//
//*****************************************************************************
void
OTGDeviceDisconnect(unsigned long ulIndex)
{
    //
    // This function is only valid when called in host mode.
    //
    if(g_eOTGModeState == USB_OTG_MODE_A_HOST)
    {
        //
        // No longer a host so switch to unconfigured mode.
        //
        USBOTGSetMode(USB_MODE_NONE);

