elua/elua/src/platform/lm3s/usblib/usbmode.c
        g_eOTGModeState = USB_OTG_MODE_WAIT;
    }
}

//*****************************************************************************
//
//! This function is the main routine for the OTG Controller Driver.
//!
//! \param ulMsTicks is the number of milliseconds that have passed since the
//! last time this function was called.
//!
//! This function is the main routine for the USB controller when using the
//! library in OTG mode.  This routine must be called periodically by the main
//! application outside of a callback context.  The \e ulMsTicks value is used
//! for basic timing needed by the USB library when operating in OTG mode.  This
//! allows for a simple cooperative system to access the the OTG controller
//! driver interface without the need for an RTOS.  All time critical operations
//! are handled in interrupt context but all longer operations are run from
//! the this function to allow them to block and wait for completion without
//! holding off other interrupts.
//!
//! \return None.
//
//*****************************************************************************
void
USBOTGMain(unsigned long ulMsTicks)
{
    if(ulMsTicks > g_ulWaitTicks)
    {
        g_ulWaitTicks = 0;
    }
    else
    {
        g_ulWaitTicks -= ulMsTicks;
    }

    switch(g_eOTGModeState)
    {
        case USB_OTG_MODE_IDLE:
        {
            g_eOTGModeState = USB_OTG_MODE_WAITID;

            //
            // Initiate a session request and check the ID pin.
            //
            USBOTGSessionRequest(USB0_BASE, true);
            break;
        }
        case USB_OTG_MODE_WAIT:
        case USB_OTG_MODE_WAITID:
        {
            //
            // If reached the timeout and polling is enabled then look again.
            //
            if((g_ulWaitTicks == 0) && (g_ulPollRate != 0))
            {
                //
                // Remove the session request.
                //
                USBOTGSessionRequest(USB0_BASE, false);

                //
                // Return to idle mode.
                //
                USBOTGSetMode(USB_MODE_NONE);

                //
                // Check if the controller is automatically applying power or
                // not.
                //
                if(USBHCDPowerAutomatic(0) == 0)
                {
                    //
                    // Call the registered event driver to allow it to disable
                    // power.
                    //
                    InternalUSBHCDSendEvent(USB_EVENT_POWER_DISABLE);
                }

                //
                // Go back to the idle state.
                //
                g_eOTGModeState = USB_OTG_MODE_IDLE;
            }
            break;
        }
        case USB_OTG_MODE_A_HOST:
        {
            //
            // Call the host main routine when acting as a host.
            //
            USBHCDMain();
            break;
        }
        case USB_OTG_MODE_B_WAITCON:
        case USB_OTG_MODE_B_DEVICE:
        default:
        {
            break;
        }
    }
}

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
